{"version":"1","records":[{"hierarchy":{"lvl1":"Lecture 01"},"type":"lvl1","url":"/images","position":0},{"hierarchy":{"lvl1":"Lecture 01"},"content":"Here are some images that represent the prayer postures discussed in Lecture 1: Why Study the History of Christianity?","type":"content","url":"/images","position":1},{"hierarchy":{"lvl1":"Lecture 01","lvl2":"Images representing prayer postures"},"type":"lvl2","url":"/images#images-representing-prayer-postures","position":2},{"hierarchy":{"lvl1":"Lecture 01","lvl2":"Images representing prayer postures"},"content":"\n\n“Grand Pastoral Sarcophagus” from Via Prenestina, painted and gilt, late 3rd/early 4th c. Vatican Museums, 31485 (ex 150)\n\nSource\n\n\n\nSource","type":"content","url":"/images#images-representing-prayer-postures","position":3},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?"},"type":"lvl1","url":"/why-study","position":0},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?"},"content":"","type":"content","url":"/why-study","position":1},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"Introduction"},"type":"lvl2","url":"/why-study#introduction","position":2},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"Introduction"},"content":"It was a great surprise to start this course with the question of what different it makes if we stand, kneel, or sit to pray. The posture we assume when we pray is not a trivial matter. It reflects our understanding of who God is and who we are in relation to Him.\n\nProf. Rylaarsdam explained the origins of the expression “The Lord be with you”, recalling Boaz’s greeting to his workers in Ruth 2:4. This greeting is not just a polite expression; it carries deep theological significance. It acknowledges God’s presence and blessing in our lives, especially in communal worship settings.\n\nHe also presenteded the three postures for prayer in the ancient church (and guess what? sitting was not one of them!): standing, kneeling, and prostrating. Each posture has its own meaning and significance:\n\nStanding is a posture of respect and attentiveness,\n\nKneeling is a posture of humility and submission, and\n\nProstrating is a posture of total surrender and worship, also connected to repentance.\n\nAfter a few presentations among the students, we turned to the main question of the lecture: Why study the history of Christianity? Or as stated by Prof. Rylaarsdam, “What difference does it make to know church history?”","type":"content","url":"/why-study#introduction","position":3},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"1. Reasons to Study Church History"},"type":"lvl2","url":"/why-study#id-1-reasons-to-study-church-history","position":4},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"1. Reasons to Study Church History"},"content":"Many reasons were presented during the lecture, and I would like to summarize the main ones here:\n\nTo understand our identity as Christians: Church history helps us to see how our faith has been shaped and formed over the centuries. It reminds us that we are part of a larger story, a story that goes back to the early church and continues to this day.\n\nTo learn from the past: By studying church history, we can learn from the successes and failures of those who came before us. We can see how they navigated challenges and controversies, and we can apply those lessons to our own lives and ministries.\n\nTo appreciate the diversity of the Christian tradition: Church history reveals the rich diversity of the Christian tradition. It shows us how different cultures and contexts have shaped the way we understand and practice our faith.\n\nTo deepen our faith: Studying church history can deepen our faith by helping us to see the faithfulness of God throughout the ages. It reminds us that we are part of a larger story of God’s work in the world.\n\nThe main take was that church history forms Christians for a missional encounter with culture as we observe how the church in the past did that. It is not just an academic exercise but a practical one that equips us to live out our faith in the world today.","type":"content","url":"/why-study#id-1-reasons-to-study-church-history","position":5},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"2. An Alien-tropological Experience"},"type":"lvl2","url":"/why-study#id-2-an-alien-tropological-experience","position":6},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"2. An Alien-tropological Experience"},"content":"We can see church history as an alien-tropological experience, where we encounter the “otherness” of past Christians. If we do the exercise of pretending we are some alien anthropologists studying human culture, we can approach church history with a sense of curiosity and openness. We can learn to appreciate the differences and similarities between our own context and that of past Christians.\n\nThe example given in class invited us to travel to different ages and places in church history, trying to understand what Christians were doing, what were their priorities, and how they expressed their faith. This exercise can help us to see church history not just as a series of dates and events but as a living and dynamic story of God’s work in the world.\n\nAfter pretending to be an alien grad student, the question posed was:\n\nWhat should the grad student in interplanetary religions conclude about Christianity?\n\nOne of the points raised was the fact that Christianity has been remarkably adaptive and resilient throughout history. It has been able to take root in diverse cultures and contexts, while still maintaining its core message and identity. This adaptability is a testament to the power of the Christian faith and its ability to speak to the human condition across time and space.","type":"content","url":"/why-study#id-2-an-alien-tropological-experience","position":7},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"3. How to Study Church History"},"type":"lvl2","url":"/why-study#id-3-how-to-study-church-history","position":8},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"3. How to Study Church History"},"content":"A few quotes were presented to guide us in our study of church history:\n\nIn modernity, church history has often been taught not “in terms of the missionary advance in successive encounters of the gospel with different forms of human culture and society, but rather as a story of the doctrinal and other conflicts within the life of the church.” (L. Newbigin)\n\nI wish someone had told me in seminary that the Christological and Trinitarian controversies of the second and third century were first and foremost issues of contextualization. (L. Newbigin)\n\nWe have to ask in all sincerity whether the study of the history of the church ought not to be completely redesigned. (David Bosch)\n\nThese quotes highlight the importance of approaching church history with a missional and contextual perspective. We should not just focus on doctrinal disputes but also on how the gospel has been communicated and lived out in different cultural settings.\n\nTo provide a tool for studying church history, Prof. Rylaarsdam introduced us the two principles for missional encounters with culture:\n\nThe indigenizing principle: Christianity enters a culture and finds customs that embody the way of Christ. Christians celebrate the culture. They are residents in it.\n\nThe pilgrim principle: Christianity enters a culture and finds ways in which the culture contradicts the way and teachings of Christ. Christians seek to embody alternatives. They are not fully at home; they are resident aliens (paroikoi) in it.\n\nThese two principles are constantly in conflict and tension with each other throughout church history. Christians have to navigate between celebrating the culture and embodying alternatives to it.\n\nOn paroikoi\n\nThe connection of the pilgrim principle and the idea of Christians as “resident aliens” (paroikoi) reminded me of 1 Peter 2:11-12:\n\nDear friends, I urge you, as foreigners and exiles (paroikoi), to abstain from sinful desires, which wage war against your soul. Live such good lives among the pagans that, though they accuse you of doing wrong, they may see your good deeds and glorify God on the day he visits us.\n\nThe biggest challenge presented for us is to pursue “faithful contextualization rather than syncretistic accommodation”.\n\nSince the Gospel is translatable by its very nature, it can take on many cultural forms. In that translation the Gospel both affirms the creational good and judges the idolatrous twisting of all cultural forms. (Mike Goheen)\n\nWe then passed to the next discussion on the way to study church history faithfully by asking in each historical context:\n\nWhat’s my context?\n\nWhat’s the gospel in this context?\n\nWhat’s the mission of God’s people in this context?\n\nAs a ministry leader, how can I equip people for mission in this context?\n\nThis will be the topic for the next lecture.","type":"content","url":"/why-study#id-3-how-to-study-church-history","position":9},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"Prayers"},"type":"lvl2","url":"/why-study#prayers","position":10},{"hierarchy":{"lvl1":"Lecture 1: Why Study the History of Christianity?","lvl2":"Prayers"},"content":"Below are some prayers from early Christian writers that were shared during the lecture.\n\nClement of Alexandria’s PrayerBe kind to us, your little children, Lord – that is what we ask of you as our Tutor.  \nGrant that by doing what you have told us to do, \n    we may achieve a faithful likeness to the Image \n    and find you to be a good God and a lenient Judge.\nMay we all live in the peace that comes from you.\n    May we journey towards your city, \n        sailing through the waters of sin untouched by the waves, \n        carried peacefully along by the Holy Spirit, your Wisdom beyond all telling.  \nNight and day until the last day of all, \n    may our praises give you thanks, our thanksgiving praise you:  \n    you who alone are both Father and Son, \n    the Son who is our Tutor and our Teacher, together with the Holy Spirit.  \nAmen.","type":"content","url":"/why-study#prayers","position":11},{"hierarchy":{"lvl1":"Lecture 02"},"type":"lvl1","url":"/images-1","position":0},{"hierarchy":{"lvl1":"Lecture 02"},"content":"Here are some images that represent the prayer postures discussed in Lecture 2: Roman Persecution.","type":"content","url":"/images-1","position":1},{"hierarchy":{"lvl1":"Lecture 02","lvl2":"Images related to the Roman Empire context"},"type":"lvl2","url":"/images-1#images-related-to-the-roman-empire-context","position":2},{"hierarchy":{"lvl1":"Lecture 02","lvl2":"Images related to the Roman Empire context"},"content":"\n\nThe Roman Empire in 117 AD at its greatest extent, at the time of Trajan’s death (with its vassals in pink) \n\nSource","type":"content","url":"/images-1#images-related-to-the-roman-empire-context","position":3},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution"},"type":"lvl1","url":"/roman-persecution","position":0},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution"},"content":"","type":"content","url":"/roman-persecution","position":1},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"Introduction"},"type":"lvl2","url":"/roman-persecution#introduction","position":2},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"Introduction"},"content":"This lecture happened on September 8, 2025, and it focused on the Roman empire’s persecution of Christians. Prof. Rylaarsdam discussed the historical context of the Roman Empire during the first few centuries AD, highlighting the political, social, and religious factors that contributed to the persecution of Christians.","type":"content","url":"/roman-persecution#introduction","position":3},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"1. The first church council: a judaizing heresy"},"type":"lvl2","url":"/roman-persecution#id-1-the-first-church-council-a-judaizing-heresy","position":4},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"1. The first church council: a judaizing heresy"},"content":"Acts 15 describes the first church council, which took place in Jerusalem around 50 AD. The council was convened to address the question of whether Gentile converts to Christianity needed to follow Jewish customs and laws, such as circumcision and dietary restrictions. The council ultimately decided that Gentile converts did not need to follow these customs, but they were asked to abstain from certain practices that were particularly offensive to Jewish Christians, such as eating food sacrificed to idols.\n\nThe meeting of the council was significant because it marked a turning point in the early church’s understanding of its identity and mission. It affirmed that Christianity was not simply a sect of Judaism but a distinct faith that welcomed Gentile believers. This decision helped to pave the way for the spread of Christianity throughout the Roman Empire and beyond.\n\nIt is quite fascinating that they wrote down the decisions of the council in a letter to be sent to the churches. This shows the importance of communication and unity in the early church, as well as the recognition that the decisions made at the council had implications for the wider Christian community.\n\nThe letter to the gentiles from Acts 15\n\n28 It seemed good to the Holy Spirit and to us not to burden you with anything beyond the following requirements:\n\n29 You are to abstain from food sacrificed to idols, from blood, from the meat of strangled animals and from sexual immorality. You will do well to avoid these things.\n\nFarewell.","type":"content","url":"/roman-persecution#id-1-the-first-church-council-a-judaizing-heresy","position":5},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"2. The ancient church and their 4 periods"},"type":"lvl2","url":"/roman-persecution#id-2-the-ancient-church-and-their-4-periods","position":6},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"2. The ancient church and their 4 periods"},"content":"The lecture then moved to refresh the illustration of the seminary alien grad student and his perceptions of Christianity. Regarding the indigenizing and pilgrim principles, it was noted that there are good things in every culture that can be celebrated by Christians. However, there are also bad things that need to be rejected or redeemed.\n\nSome recommendation of Andrew Walls’ work on the history of Christianity and culture was given, particularly his book “The Missionary Movement in Christian History: Studies in the Transmission of Faith.” \n\nWalls, 2015\n\nA discussion on faithful contextualization followed, starting by the presentation of the ancient church context.\n\nThe ancient church from 100-313 AD faced mainly two challenges:\n\nWhat is our identity in relation to Judaism?\n\nHow do we engage with the surrounding idolatrous Greco-Roman culture?\n\nAnd these first centuries will be the focus of the following lectures. Later, the other three periods of church history will be presented. The four periods can be summarized as follows:\n\nPeriod\n\nTime Period\n\nKey Events\n\nAncient Church\n\n100-313\n\nApostolic Fathers – Edict of Milan\n\nChristian Empire\n\n313-600\n\nEdict of Milan – Gregory the Great\n\nEarly Middle Ages\n\n600-1054\n\nGregory the Great – Great Schism\n\nHigh Middle Ages\n\n1054-1274\n\nGreat Schism – Bonaventure/Aquinas","type":"content","url":"/roman-persecution#id-2-the-ancient-church-and-their-4-periods","position":7},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"type":"lvl2","url":"/roman-persecution#id-3-the-roman-empire-context-i-what-is-the-context","position":8},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"content":"","type":"content","url":"/roman-persecution#id-3-the-roman-empire-context-i-what-is-the-context","position":9},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl3":"Political Context","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"type":"lvl3","url":"/roman-persecution#political-context","position":10},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl3":"Political Context","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"content":"To understand the period from 100-313 AD, we need to understand the context of the Roman Empire during this time. The empire was vast and diverse, encompassing many different cultures and religions. The Roman government was generally tolerant of different religious practices, as long as they did not threaten the stability of the empire. However, Christians were often viewed with suspicion and hostility by the Roman authorities.\n\nPolitically, there is unity and peace in the Roman Empire. No major wars were happening for the last 200 years. This period is known as the Pax Romana, or Roman Peace. The empire was ruled by a series of emperors who maintained order and stability throughout the empire. The mentality that trusting in the goodness of human beings brought the hope of a permanent social order.\n\nThe Roman ideal became part of the cultural fabric of the empire. The emperor was seen as a divine figure, and loyalty to the empire was considered a civic duty. This created a challenging environment for Christians, who refused to worship the emperor or participate in certain civic rituals that were seen as idolatrous.","type":"content","url":"/roman-persecution#political-context","position":11},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl3":"Cultural Context","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"type":"lvl3","url":"/roman-persecution#cultural-context","position":12},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl3":"Cultural Context","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"content":"Culturally, the unified language, cultural uniformity, art, education (paideia), transportation, and communication networks helped to create a sense of shared identity and purpose among the diverse peoples of the empire.\n\nPaideia\n\nThe Greek word “paideia” refers to the system of education and cultural upbringing in ancient Greece and Rome. It encompassed not only formal education but also the broader cultural values, norms, and practices that shaped individuals into well-rounded citizens. Paideia emphasized the development of intellectual, moral, and physical virtues, aiming to cultivate individuals who could contribute positively to society. In the Roman context, paideia included the study of literature, philosophy, rhetoric, and the arts, as well as physical training and civic responsibility.\n\nDespite the general peace and stability of the Roman Empire during this period, the decadence of morality and the increasing use of Latin as the common language in the western part of the empire were signs of decline.","type":"content","url":"/roman-persecution#cultural-context","position":13},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl3":"Moral and Religious Context","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"type":"lvl3","url":"/roman-persecution#moral-and-religious-context","position":14},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl3":"Moral and Religious Context","lvl2":"3. The Roman Empire Context (I - What is the Context?)"},"content":"The moral decline of the Roman Empire is certainly connected to the religious situation, where a polytheistic and syncretistic approach to religion prevailed, leading to moral decay and spiritual emptiness. Also, there were two Roman Empires. The one worshiped by the people and the one that actually ruled. The intelligentsia was mostly skeptical of the traditional Roman religion and used it in a utilitarian way.\n\nWhat is true?\n\nPontius Pilate posture when interrogating Jesus is a good representation of the Roman attitude towards religion: “What is truth?” (John 18:38). This question reflects the relativistic and pragmatic approach to religion that characterized the Roman Empire during this period.\n\nAnother characteristic of the Roman context is that life was cheap. The widespread acceptance of practices such as gladiatorial games, public executions, and other forms of entertainment that involved violence and death reflected a culture that devalued human life. This moral climate created a challenging environment for Christians, who were called to uphold the sanctity of life and reject the prevailing cultural norms.","type":"content","url":"/roman-persecution#moral-and-religious-context","position":15},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"3. Making disciples who make disciples (What is the mission?)"},"type":"lvl2","url":"/roman-persecution#id-3-making-disciples-who-make-disciples-what-is-the-mission","position":16},{"hierarchy":{"lvl1":"Lecture 2: Roman Persecution","lvl2":"3. Making disciples who make disciples (What is the mission?)"},"content":"Fledging (early) Christians were called to make disciples who make disciples in this challenging context. The mission of the church was to proclaim the gospel and to live out the teachings of Jesus in a way that was faithful to their identity as followers of Christ.\n\nThe life of Christians in this period was marked by persecution and suffering, as they faced hostility from both the Roman authorities and the surrounding culture. The main figures of this period were:\n\nApostolic Fathers: Early Christian writers who were direct disciples of the apostles, such as Clement of Rome, Ignatius of Antioch, and Polycarp of Smyrna. They provided guidance and encouragement to the early Christian communities.\n\nMartyrs: Christians who were persecuted and killed for their faith, such as Stephen, Perpetua, and Felicity. Their witness and sacrifice inspired others to remain faithful in the face of persecution.\n\nApologists: Christian writers who defended the faith against pagan criticisms and misconceptions, such as Justin Martyr and Tertullian. They sought to explain and justify Christian beliefs and practices in a way that was understandable to the broader culture.\n\nMonks: Although monasticism would develop more fully in later centuries, some early forms of asceticism and communal living can be traced back to this period. Early ascetics sought to live lives of holiness and devotion, often withdrawing from the world to focus on prayer and spiritual discipline.\n\nAnd that’s where we will pick up in the next lecture!","type":"content","url":"/roman-persecution#id-3-making-disciples-who-make-disciples-what-is-the-mission","position":17},{"hierarchy":{"lvl1":"Story Of Christianity I"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Story Of Christianity I"},"content":"","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Story Of Christianity I","lvl2":"Introduction"},"type":"lvl2","url":"/#introduction","position":2},{"hierarchy":{"lvl1":"Story Of Christianity I","lvl2":"Introduction"},"content":"This is a journal documenting my journey through the course “Story Of Christianity I” offered by Calvin Seminary. The course explores the history of Christianity from its origins to the medieval period, examining key events, figures, and theological developments.\n\nThis journal will include summaries of lectures, reflections on readings, and personal insights gained throughout the course. It aims to provide a comprehensive overview of the material covered and to deepen my understanding of the Christian faith and its historical context. The main goal is to inform myself and keep track of the knowledge acquired during this educational experience.\n\nPlease don’t use this journal as a faithful source, as it is primarily for personal use and reflection.","type":"content","url":"/#introduction","position":3}]}