{"version":"1","records":[{"hierarchy":{"lvl1":"Lecture 1.1"},"type":"lvl1","url":"/images","position":0},{"hierarchy":{"lvl1":"Lecture 1.1"},"content":"Here are some images that represent the prayer postures discussed in Lecture 1: Why Study the History of Christianity?","type":"content","url":"/images","position":1},{"hierarchy":{"lvl1":"Lecture 1.1","lvl2":"Images representing prayer postures"},"type":"lvl2","url":"/images#images-representing-prayer-postures","position":2},{"hierarchy":{"lvl1":"Lecture 1.1","lvl2":"Images representing prayer postures"},"content":"\n\n“Grand Pastoral Sarcophagus” from Via Prenestina, painted and gilt, late 3rd/early 4th c. Vatican Museums, 31485 (ex 150)\n\nSource\n\n\n\nSource","type":"content","url":"/images#images-representing-prayer-postures","position":3},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?"},"type":"lvl1","url":"/why-study","position":0},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?"},"content":"","type":"content","url":"/why-study","position":1},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"Introduction"},"type":"lvl2","url":"/why-study#introduction","position":2},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"Introduction"},"content":"It was a great surprise to start this course with the question of what difference it makes if we stand, kneel, or sit to pray. The posture we assume when we pray is not a trivial matter. It reflects our understanding of who God is and who we are in relation to Him.\n\nProf. Rylaarsdam explained the origins of the expression “The Lord be with you”, recalling Boaz’s greeting to his workers in Ruth 2:4. This greeting is not just a polite expression; it carries deep theological significance. It acknowledges God’s presence and blessing in our lives, especially in communal worship settings.\n\nHe also presented the three postures for prayer in the ancient church (and guess what? sitting was not one of them!): standing, kneeling, and prostrating. Each posture has its own meaning and significance:\n\nStanding is a posture of respect and attentiveness,\n\nKneeling is a posture of humility and submission, and\n\nProstrating is a posture of total surrender and worship, also connected to repentance.\n\nAfter a few presentations among the students, we turned to the main question of the lecture: Why study the history of Christianity? Or as stated by Prof. Rylaarsdam, “What difference does it make to know church history?”","type":"content","url":"/why-study#introduction","position":3},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"1. Reasons to Study Church History"},"type":"lvl2","url":"/why-study#id-1-reasons-to-study-church-history","position":4},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"1. Reasons to Study Church History"},"content":"Many reasons were presented during the lecture, and I would like to summarize the main ones here:\n\nTo understand our identity as Christians: Church history helps us to see how our faith has been shaped and formed over the centuries. It reminds us that we are part of a larger story, a story that goes back to the early church and continues to this day.\n\nTo learn from the past: By studying church history, we can learn from the successes and failures of those who came before us. We can see how they navigated challenges and controversies, and we can apply those lessons to our own lives and ministries.\n\nTo appreciate the diversity of the Christian tradition: Church history reveals the rich diversity of the Christian tradition. It shows us how different cultures and contexts have shaped the way we understand and practice our faith.\n\nTo deepen our faith: Studying church history can deepen our faith by helping us to see the faithfulness of God throughout the ages. It reminds us that we are part of a larger story of God’s work in the world.\n\nThe main take was that church history forms Christians for a missional encounter with culture as we observe how the church in the past did that. It is not just an academic exercise but a practical one that equips us to live out our faith in the world today.","type":"content","url":"/why-study#id-1-reasons-to-study-church-history","position":5},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"2. An Alien-tropological Experience"},"type":"lvl2","url":"/why-study#id-2-an-alien-tropological-experience","position":6},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"2. An Alien-tropological Experience"},"content":"We can see church history as an alien-tropological experience, where we encounter the “otherness” of past Christians. If we do the exercise of pretending we are some alien anthropologists studying human culture, we can approach church history with a sense of curiosity and openness. We can learn to appreciate the differences and similarities between our own context and that of past Christians.\n\nThe example given in class invited us to travel to different ages and places in church history, trying to understand what Christians were doing, what were their priorities, and how they expressed their faith. This exercise can help us to see church history not just as a series of dates and events but as a living and dynamic story of God’s work in the world.\n\nAfter pretending to be an alien grad student, the question posed was:\n\nWhat should the grad student in interplanetary religions conclude about Christianity?\n\nOne of the points raised was the fact that Christianity has been remarkably adaptive and resilient throughout history. It has been able to take root in diverse cultures and contexts, while still maintaining its core message and identity. This adaptability is a testament to the power of the Christian faith and its ability to speak to the human condition across time and space.","type":"content","url":"/why-study#id-2-an-alien-tropological-experience","position":7},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"3. How to Study Church History"},"type":"lvl2","url":"/why-study#id-3-how-to-study-church-history","position":8},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"3. How to Study Church History"},"content":"A few quotes were presented to guide us in our study of church history:\n\nIn modernity, church history has often been taught not “in terms of the missionary advance in successive encounters of the gospel with different forms of human culture and society, but rather as a story of the doctrinal and other conflicts within the life of the church.” (L. Newbigin)\n\nI wish someone had told me in seminary that the Christological and Trinitarian controversies of the second and third century were first and foremost issues of contextualization. (L. Newbigin)\n\nWe have to ask in all sincerity whether the study of the history of the church ought not to be completely redesigned. (David Bosch)\n\nThese quotes highlight the importance of approaching church history with a missional and contextual perspective. We should not just focus on doctrinal disputes but also on how the gospel has been communicated and lived out in different cultural settings.\n\nTo provide a tool for studying church history, Prof. Rylaarsdam introduced us the two principles for missional encounters with culture:\n\nThe indigenizing principle: Christianity enters a culture and finds customs that embody the way of Christ. Christians celebrate the culture. They are residents in it.\n\nThe pilgrim principle: Christianity enters a culture and finds ways in which the culture contradicts the way and teachings of Christ. Christians seek to embody alternatives. They are not fully at home; they are resident aliens (paroikoi) in it.\n\nThese two principles are constantly in conflict and tension with each other throughout church history. Christians have to navigate between celebrating the culture and embodying alternatives to it.\n\nOn paroikoi\n\nThe connection of the pilgrim principle and the idea of Christians as “resident aliens” (paroikoi) reminded me of 1 Peter 2:11-12:\n\nDear friends, I urge you, as foreigners and exiles (paroikoi), to abstain from sinful desires, which wage war against your soul. Live such good lives among the pagans that, though they accuse you of doing wrong, they may see your good deeds and glorify God on the day he visits us.\n\nThe biggest challenge presented for us is to pursue “faithful contextualization rather than syncretistic accommodation”.\n\nSince the Gospel is translatable by its very nature, it can take on many cultural forms. In that translation the Gospel both affirms the creational good and judges the idolatrous twisting of all cultural forms. (Mike Goheen)\n\nWe then passed to the next discussion on the way to study church history faithfully by asking in each historical context:\n\nWhat’s my context?\n\nWhat’s the gospel in this context?\n\nWhat’s the mission of God’s people in this context?\n\nAs a ministry leader, how can I equip people for mission in this context?\n\nThis will be the topic for the next lecture.","type":"content","url":"/why-study#id-3-how-to-study-church-history","position":9},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"Prayers"},"type":"lvl2","url":"/why-study#prayers","position":10},{"hierarchy":{"lvl1":"Lecture 1.1: Why Study the History of Christianity?","lvl2":"Prayers"},"content":"Below are some prayers from early Christian writers that were shared during the lecture.\n\nClement of Alexandria’s PrayerBe kind to us, your little children, Lord – that is what we ask of you as our Tutor.  \nGrant that by doing what you have told us to do, \n    we may achieve a faithful likeness to the Image \n    and find you to be a good God and a lenient Judge.\nMay we all live in the peace that comes from you.\n    May we journey towards your city, \n        sailing through the waters of sin untouched by the waves, \n        carried peacefully along by the Holy Spirit, your Wisdom beyond all telling.  \nNight and day until the last day of all, \n    may our praises give you thanks, our thanksgiving praise you:  \n    you who alone are both Father and Son, \n    the Son who is our Tutor and our Teacher, together with the Holy Spirit.  \nAmen.","type":"content","url":"/why-study#prayers","position":11},{"hierarchy":{"lvl1":"Lecture 2.1"},"type":"lvl1","url":"/images-1","position":0},{"hierarchy":{"lvl1":"Lecture 2.1"},"content":"Here are some images that represent the prayer postures discussed in Lecture 2: Roman Persecution.","type":"content","url":"/images-1","position":1},{"hierarchy":{"lvl1":"Lecture 2.1","lvl2":"Images related to the Roman Empire context"},"type":"lvl2","url":"/images-1#images-related-to-the-roman-empire-context","position":2},{"hierarchy":{"lvl1":"Lecture 2.1","lvl2":"Images related to the Roman Empire context"},"content":"\n\nThe Roman Empire in 117 AD at its greatest extent, at the time of Trajan’s death (with its vassals in pink) \n\nSource","type":"content","url":"/images-1#images-related-to-the-roman-empire-context","position":3},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution"},"type":"lvl1","url":"/roman-persecution","position":0},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution"},"content":"","type":"content","url":"/roman-persecution","position":1},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"Introduction"},"type":"lvl2","url":"/roman-persecution#introduction","position":2},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"Introduction"},"content":"This lecture happened on September 8, 2025, and it focused on the Roman empire’s persecution of Christians. Prof. Rylaarsdam discussed the historical context of the Roman Empire during the first few centuries AD, highlighting the political, social, and religious factors that contributed to the persecution of Christians.\n\nA great part of the class was to discuss the Introduction of the book “On the Incarnation” by Athanasius of Alexandria. This introduction was written by C.S. Lewis, and it is an encouragement for those who want to understand the early church to read the original sources. \n\nAthanasius, 2011","type":"content","url":"/roman-persecution#introduction","position":3},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"1. The first church council: a judaizing heresy"},"type":"lvl2","url":"/roman-persecution#id-1-the-first-church-council-a-judaizing-heresy","position":4},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"1. The first church council: a judaizing heresy"},"content":"Acts 15 describes the first church council, which took place in Jerusalem around 50 AD. The council was convened to address the question of whether Gentile converts to Christianity needed to follow Jewish customs and laws, such as circumcision and dietary restrictions. The council ultimately decided that Gentile converts did not need to follow these customs, but they were asked to abstain from certain practices that were particularly offensive to Jewish Christians, such as eating food sacrificed to idols.\n\nThe meeting of the council was significant because it marked a turning point in the early church’s understanding of its identity and mission. It affirmed that Christianity was not simply a sect of Judaism but a distinct faith that welcomed Gentile believers. This decision helped to pave the way for the spread of Christianity throughout the Roman Empire and beyond.\n\nIt is quite fascinating that they wrote down the decisions of the council in a letter to be sent to the churches. This shows the importance of communication and unity in the early church, as well as the recognition that the decisions made at the council had implications for the wider Christian community.\n\nThe letter to the gentiles from Acts 15\n\n28 It seemed good to the Holy Spirit and to us not to burden you with anything beyond the following requirements:\n\n29 You are to abstain from food sacrificed to idols, from blood, from the meat of strangled animals and from sexual immorality. You will do well to avoid these things.\n\nFarewell.","type":"content","url":"/roman-persecution#id-1-the-first-church-council-a-judaizing-heresy","position":5},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"2. The ancient church and their 4 periods"},"type":"lvl2","url":"/roman-persecution#id-2-the-ancient-church-and-their-4-periods","position":6},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"2. The ancient church and their 4 periods"},"content":"The lecture then moved to refresh the illustration of the seminary alien grad student and his perceptions of Christianity. Regarding the indigenizing and pilgrim principles, it was noted that there are good things in every culture that can be celebrated by Christians. However, there are also bad things that need to be rejected or redeemed.\n\nSome recommendation of Andrew Walls’ work on the history of Christianity and culture was given, particularly his book “The Missionary Movement in Christian History: Studies in the Transmission of Faith.” \n\nWalls, 2015\n\nA discussion on faithful contextualization followed, starting by the presentation of the ancient church context.\n\nThe ancient church from 100-313 AD faced mainly two challenges:\n\nWhat is our identity in relation to Judaism?\n\nHow do we engage with the surrounding idolatrous Greco-Roman culture?\n\nAnd these first centuries will be the focus of the following lectures. Later, the other three periods of church history will be presented. The four periods can be summarized as follows:\n\nPeriod\n\nTime Period\n\nKey Events\n\nAncient Church\n\n100-313\n\nApostolic Fathers – Edict of Milan\n\nChristian Empire\n\n313-600\n\nEdict of Milan – Gregory the Great\n\nEarly Middle Ages\n\n600-1054\n\nGregory the Great – Great Schism\n\nHigh Middle Ages\n\n1054-1274\n\nGreat Schism – Bonaventure/Aquinas","type":"content","url":"/roman-persecution#id-2-the-ancient-church-and-their-4-periods","position":7},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"3. The Roman Empire Context (What is the Context?)"},"type":"lvl2","url":"/roman-persecution#id-3-the-roman-empire-context-what-is-the-context","position":8},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"3. The Roman Empire Context (What is the Context?)"},"content":"","type":"content","url":"/roman-persecution#id-3-the-roman-empire-context-what-is-the-context","position":9},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl3":"Political Context","lvl2":"3. The Roman Empire Context (What is the Context?)"},"type":"lvl3","url":"/roman-persecution#political-context","position":10},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl3":"Political Context","lvl2":"3. The Roman Empire Context (What is the Context?)"},"content":"To understand the period from 100-313 AD, we need to understand the context of the Roman Empire during this time. The empire was vast and diverse, encompassing many different cultures and religions. The Roman government was generally tolerant of different religious practices, as long as they did not threaten the stability of the empire. However, Christians were often viewed with suspicion and hostility by the Roman authorities.\n\nPolitically, there is unity and peace in the Roman Empire. No major wars were happening for the last 200 years. This period is known as the Pax Romana, or Roman Peace. The empire was ruled by a series of emperors who maintained order and stability throughout the empire. The mentality that trusting in the goodness of human beings brought the hope of a permanent social order.\n\nThe Roman ideal became part of the cultural fabric of the empire. The emperor was seen as a divine figure, and loyalty to the empire was considered a civic duty. This created a challenging environment for Christians, who refused to worship the emperor or participate in certain civic rituals that were seen as idolatrous.","type":"content","url":"/roman-persecution#political-context","position":11},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl3":"Cultural Context","lvl2":"3. The Roman Empire Context (What is the Context?)"},"type":"lvl3","url":"/roman-persecution#cultural-context","position":12},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl3":"Cultural Context","lvl2":"3. The Roman Empire Context (What is the Context?)"},"content":"Culturally, the unified language, cultural uniformity, art, education (paideia), transportation, and communication networks helped to create a sense of shared identity and purpose among the diverse peoples of the empire.\n\nPaideia\n\nThe Greek word “paideia” refers to the system of education and cultural upbringing in ancient Greece and Rome. It encompassed not only formal education but also the broader cultural values, norms, and practices that shaped individuals into well-rounded citizens. Paideia emphasized the development of intellectual, moral, and physical virtues, aiming to cultivate individuals who could contribute positively to society. In the Roman context, paideia included the study of literature, philosophy, rhetoric, and the arts, as well as physical training and civic responsibility.\n\nDespite the general peace and stability of the Roman Empire during this period, the decadence of morality and the increasing use of Latin as the common language in the western part of the empire were signs of decline.","type":"content","url":"/roman-persecution#cultural-context","position":13},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl3":"Moral and Religious Context","lvl2":"3. The Roman Empire Context (What is the Context?)"},"type":"lvl3","url":"/roman-persecution#moral-and-religious-context","position":14},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl3":"Moral and Religious Context","lvl2":"3. The Roman Empire Context (What is the Context?)"},"content":"The moral decline of the Roman Empire is certainly connected to the religious situation, where a polytheistic and syncretistic approach to religion prevailed, leading to moral decay and spiritual emptiness. Also, there were two Roman Empires. The one worshiped by the people and the one that actually ruled. The intelligentsia was mostly skeptical of the traditional Roman religion and used it in a utilitarian way.\n\nWhat is true?\n\nPontius Pilate posture when interrogating Jesus is a good representation of the Roman attitude towards religion: “What is truth?” (John 18:38). This question reflects the relativistic and pragmatic approach to religion that characterized the Roman Empire during this period.\n\nAnother characteristic of the Roman context is that life was cheap. The widespread acceptance of practices such as gladiatorial games, public executions, and other forms of entertainment that involved violence and death reflected a culture that devalued human life. This moral climate created a challenging environment for Christians, who were called to uphold the sanctity of life and reject the prevailing cultural norms.","type":"content","url":"/roman-persecution#moral-and-religious-context","position":15},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"3. Making disciples who make disciples (What is the mission?)"},"type":"lvl2","url":"/roman-persecution#id-3-making-disciples-who-make-disciples-what-is-the-mission","position":16},{"hierarchy":{"lvl1":"Lecture 2.1: Roman Persecution","lvl2":"3. Making disciples who make disciples (What is the mission?)"},"content":"Fledging (early) Christians were called to make disciples who make disciples in this challenging context. The mission of the church was to proclaim the gospel and to live out the teachings of Jesus in a way that was faithful to their identity as followers of Christ.\n\nThe life of Christians in this period was marked by persecution and suffering, as they faced hostility from both the Roman authorities and the surrounding culture. The main figures of this period were:\n\nApostolic Fathers: Early Christian writers who were direct disciples of the apostles, such as Clement of Rome, Ignatius of Antioch, and Polycarp of Smyrna. They provided guidance and encouragement to the early Christian communities.\n\nMartyrs: Christians who were persecuted and killed for their faith, such as Stephen, Perpetua, and Felicity. Their witness and sacrifice inspired others to remain faithful in the face of persecution.\n\nApologists: Christian writers who defended the faith against pagan criticisms and misconceptions, such as Justin Martyr and Tertullian. They sought to explain and justify Christian beliefs and practices in a way that was understandable to the broader culture.\n\nMonks: Although monasticism would develop more fully in later centuries, some early forms of asceticism and communal living can be traced back to this period. Early ascetics sought to live lives of holiness and devotion, often withdrawing from the world to focus on prayer and spiritual discipline.\n\nAnd that’s where we will pick up in the next lecture!","type":"content","url":"/roman-persecution#id-3-making-disciples-who-make-disciples-what-is-the-mission","position":17},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers"},"type":"lvl1","url":"/apostolic-fathers","position":0},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers"},"content":"Hymn 314 from Genevan Psalter\n\nThe lecture started with the Hymn 314 from Genevan Psalter.","type":"content","url":"/apostolic-fathers","position":1},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Introduction"},"type":"lvl2","url":"/apostolic-fathers#introduction","position":2},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Introduction"},"content":"Very little is known about the period between the New Testament writings and the early second century. However, we do have some writings from early Christian leaders known as the Apostolic Fathers. These writings provide valuable insights into the beliefs, practices, and challenges faced by the early Christian community during this formative period.\n\nSome of the main sources from the Apostolic Fathers include:\n\n1 Clement\n\nDidache\n\nIgnatius of Antioch’s 7 Letters\n\nEpistle of Barnabas\n\nThe Shepherd of Hermas (ca. 90-150)\n\nWhat does this literature tell us how early Christians (90-150 AD) perceived their mission in Hellenistic culture?\n\nHellenistic culture\n\nThe Hellenistic culture, which emerged after the conquests of Alexander the Great, was characterized by the spread of Greek language, art, architecture, and philosophy throughout the Mediterranean and Near Eastern regions. This cultural milieu significantly influenced the development of early Christianity, as it provided a common language (Koine Greek) and a rich intellectual tradition that early Christians engaged with in their theological reflections and missionary efforts.","type":"content","url":"/apostolic-fathers#introduction","position":3},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Didache (between 70 and 150 AD)"},"type":"lvl2","url":"/apostolic-fathers#didache-between-70-and-150-ad","position":4},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Didache (between 70 and 150 AD)"},"content":"The \n\nDidache, also known as “The Teaching of the Twelve Apostles,” is an early Christian document that provides instructions on various aspects of Christian life and practice. It was written in the late first or early second century. It covers topics such as baptism, fasting, prayer, the Eucharist, and church organization. The Didache reflects the communal and ethical dimensions of early Christian life, emphasizing the importance of living according to the teachings of Jesus and the apostles.\n\nThe first part of the Didache focuses on ethical teachings, including the “Two Ways” doctrine, which contrasts the way of life (following God’s commandments) with the way of death (sinful behavior). The second part provides practical instructions for Christian rituals and community life.\n\nAspects of the church life in the Didache\n\nRansom was a big topic for the early church. Also, abundance grace is seen in the Didache, to the point that those cathecumens will observe baptized Christians’ generosity after participating in the Eucharist.\n\nThe scene from the movie \n\nLes Miserables were used to illustrate the concept of ransom in the early church context. This scene depicts Jean Valjean’s stealing of silverware from the bishop, who then forgives him and gives him additional silverware, symbolizing grace and redemption. This act of forgiveness and generosity reflects the early Christian understanding of ransom, where Christ’s sacrifice is seen as a ransom for humanity’s sins, offering salvation and new life.\n\n❤️‍🔥 This touched my heart\n\n“with this silver, I bought your soul, I ransomed you from fear and hatred... and now I give you back to God.”\n\nNew Christians were invited to participate of the cathechumenate, a period of learning and preparation before baptism. After baptism, they would be fully integrated into the Christian community, participating in communal meals and the Eucharist. This was normally done during lent, every day. Christians were expected to participate in the teaching of the discipleship with their guests. Questions would be asked to the teachers, and the teachers would provide answers based on the teachings of Jesus and the apostles. Baptism was done in Easter.","type":"content","url":"/apostolic-fathers#didache-between-70-and-150-ad","position":5},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Epistle of Barnabas (130 A.D.)"},"type":"lvl2","url":"/apostolic-fathers#epistle-of-barnabas-130-a-d","position":6},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Epistle of Barnabas (130 A.D.)"},"content":"As we started talking about this document, we discussed about the fact that the canon was still not closed in the early second century. This will be discussed later, but it is important to note that most of these documents were considered scripture by some early Christian communities.\n\nThe \n\nEpistle of Barnabas is an early Christian writing that was likely composed in the late first or early second century. It is attributed to Barnabas, a companion of the Apostle Paul, although the true authorship is uncertain. The epistle addresses various theological themes, including the relationship between Judaism and Christianity, the interpretation of Old Testament scriptures, and the ethical conduct expected of Christians. The Epistle of Barnabas emphasizes the idea that Christians are the true heirs of God’s covenant, interpreting Old Testament laws in a spiritualized manner.","type":"content","url":"/apostolic-fathers#epistle-of-barnabas-130-a-d","position":7},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"The Shepherd of Hermas"},"type":"lvl2","url":"/apostolic-fathers#the-shepherd-of-hermas","position":8},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"The Shepherd of Hermas"},"content":"The last document discussed in class was The Shepherd of Hermas. This was very close to be included in the New Testament canon, but it was ultimately not accepted as scripture. Its text is a call to shape life according to what a Christian life should look like.\n\nQuestions such as “Can you repent of major sins after baptism?” and others are part of the struggles of the early church. Disagreements are part of the life of the church, but the greater concern is to be formed into Jesus form. This document will touch on these themes.\n\nThe \n\nThe Shepherd of Hermas is an early Christian literary work that was likely written in the mid-second century. It is a visionary text that combines elements of apocalyptic literature, moral exhortation, and allegory. The work is presented as a series of visions and parables experienced by a Christian named Hermas, who is guided by a figure known as the Shepherd. The Shepherd of Hermas addresses themes such as repentance, forgiveness, and the importance of living a virtuous life. It also reflects the challenges faced by the early Christian community, including issues of sin, discipline, and the hope for ultimate salvation.\n\nThe following documents were not discussed in class but are part of the Apostolic Fathers literature and were mentioned. We were also asked to read the Letters to the Magnesians, Romans, and Smyrnaeans from Ignatius of Antioch as preparation for the studies on the martyrs of the early church.","type":"content","url":"/apostolic-fathers#the-shepherd-of-hermas","position":9},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"1 Clement"},"type":"lvl2","url":"/apostolic-fathers#id-1-clement","position":10},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"1 Clement"},"content":"The letter known as \n\n1 Clement is attributed to Clement of Rome, who was a prominent leader in the early Christian community in Rome. The letter was written to the church in Corinth around 99 AD, addressing a dispute that had arisen within the Corinthian church regarding leadership and authority. This letter contains the same substance as Paul’s letters, emphasizing humility, unity, and obedience to church leaders.","type":"content","url":"/apostolic-fathers#id-1-clement","position":11},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Ignatius of Antioch’s 7 Letters"},"type":"lvl2","url":"/apostolic-fathers#ignatius-of-antiochs-7-letters","position":12},{"hierarchy":{"lvl1":"Lecture 2.2: Second-Century Christianity: Apostolic Fathers","lvl2":"Ignatius of Antioch’s 7 Letters"},"content":"Ignatius of Antioch was an early Christian bishop who wrote a series of letters to various Christian communities while on his way to Rome for martyrdom around 110 AD. His letters emphasize the importance of church unity, the role of bishops, and the significance of the Eucharist. Ignatius strongly advocated for obedience to church leaders and warned against divisions within the Christian community. He also highlighted the reality of persecution and the need for Christians to remain faithful in the face of suffering.\n\n“Father, We Give You Thanks, Who Planted”, from \n\nGenevan Psalter, 1551; harm. Pilgrim Hymnal, 1931\n\nTranslated by J. B. Lightfoot.","type":"content","url":"/apostolic-fathers#ignatius-of-antiochs-7-letters","position":13},{"hierarchy":{"lvl1":"Lecture 2.2"},"type":"lvl1","url":"/images-2","position":0},{"hierarchy":{"lvl1":"Lecture 2.2"},"content":"Here are some images that represent the documents and figures from Lecture 3: Apostolic Fathers.","type":"content","url":"/images-2","position":1},{"hierarchy":{"lvl1":"Lecture 2.2","lvl2":"Images related to the Roman Empire context"},"type":"lvl2","url":"/images-2#images-related-to-the-roman-empire-context","position":2},{"hierarchy":{"lvl1":"Lecture 2.2","lvl2":"Images related to the Roman Empire context"},"content":"\n\nThe Didache, an early Christian text that provides insight into the beliefs and practices of the Apostolic Fathers. Apparently, there were found one original fragment and one copy, both in Greek. \n\nSource","type":"content","url":"/images-2#images-related-to-the-roman-empire-context","position":3},{"hierarchy":{"lvl1":"Appendix A: Martyrs"},"type":"lvl1","url":"/martyrs-maps","position":0},{"hierarchy":{"lvl1":"Appendix A: Martyrs"},"content":"The table below show a (non-exhaustive) list of notable Christian martyrs from the early church period, along with the approximate dates of their martyrdom, the Roman emperors during whose reigns they were martyred, and the estimated number of martyrs where applicable.\n\nDate\n\nEmperor\n\nEvent/Location\n\nNames of Notable Martyrs\n\nEstimated Number\n\n~34 AD\n\nTiberius\n\nJerusalem\n\nStephen\n\n1\n\n~43-45 AD\n\nClaudius\n\nJerusalem\n\nJames the Greater (apostle)\n\n1\n\n~54 AD\n\nNero\n\nHieropolis (Turkey)\n\nPhilip the Apostle\n\n1\n\n~60 AD\n\nNero\n\nEthiopia\n\nMatthew the Apostle\n\n1\n\n64-68 AD\n\nNero\n\nRome\n\nNero’s Persecution: Peter, Paul (apostles), and numerous Christians\n\n100s\n\n~68 AD\n\nNero\n\nAlexandria\n\nMark the Apostle\n\n1\n\n~72 AD\n\nVespasian\n\nJerusalem/Edessa\n\nJude (Thaddeus) and Simon the Zealot (apostles)\n\n2\n\n~72 AD\n\nVespasian\n\nIndia\n\nThomas the Apostle\n\n1\n\n81-96 AD\n\nDomitian\n\nRoman Empire\n\nDomitian’s Persecution: various Christians throughout empire\n\n100s+\n\n~95 AD\n\nDomitian\n\nPatmos/Ephesus\n\nJohn the Apostle (exile; traditionally)\n\n1\n\n~107-110 AD\n\nTrajan\n\nRome\n\nIgnatius of Antioch\n\n1\n\n~155 AD\n\nAntoninus Pius\n\nSmyrna\n\nPolycarp\n\n1\n\n~165 AD\n\nMarcus Aurelius\n\nRome\n\nJustin Martyr and 6 companions\n\n7\n\n177 AD\n\nMarcus Aurelius\n\nLyon (Gaul)\n\nBlandina, Pothinus, and others\n\n48+\n\n~203 AD\n\nSeptimius Severus\n\nCarthage (North Africa)\n\nPerpetua, Felicity, and 3 companions\n\n5\n\n~250 AD\n\nDecius\n\nRoman Empire\n\nVarious martyrs under Decius persecution\n\n100s\n\n~258 AD\n\nValerian\n\nRome/Carthage\n\nSixtus II, Lawrence, Cyprian\n\n3\n\n303-311 AD\n\nDiocletian\n\nRoman Empire\n\nGreat Persecution under Diocletian (various locations)\n\n1000s\n\n~303 AD\n\nDiocletian\n\nNicomedia\n\nGeorge (traditional)\n\n1\n\n~304 AD\n\nDiocletian\n\nAlexandria\n\nCatherine (traditional)\n\n1\n\n~306 AD\n\nDiocletian\n\nEgypt\n\nSebastian (traditional)\n\n1\n\n313 AD\n\nConstantine\n\nRoman Empire\n\nEdict of Milan—persecution officially ends\n\n0\n\n~335 AD\n\nConstantine II\n\nPersian Empire\n\nShapur II’s Persecution: various Christians\n\n100s\n\n~380 AD\n\nTheodosius I\n\nRoman Empire\n\nChristianity becomes official religion\n\n0\n\n451 AD\n\nTheodosius II\n\nArmenia\n\nVardan Mamikonian and Armenian Christians (Battle of Avarayr)\n\n100s+\n\nNotes:\n\nDates marked with ~ are approximate, as exact dates are often uncertain\n\nNames in parentheses marked “traditional” indicate figures whose historicity is debated by scholars\n\nNumbers for mass persecutions are estimates based on historical records and church tradition\n\nBy the 5th century, persecution had largely ended in the Roman Empire following Constantine’s legalization of Christianity\n\nThe Battle of Avarayr (451 AD) is one of the last recorded large-scale Christian persecutions in antiquity\n\nThis table includes only major or well-documented martyrdoms; many others are recorded in various sources\n\nimport { BarChart, Bar, XAxis, YAxis, CartesianGrid, Tooltip, Legend, ResponsiveContainer, LineChart, Line } from ‘recharts’;\nimport { useState } from ‘react’;\n\nexport default function MartyrdomsChart() {\nconst [chartType, setChartType] = useState(‘bar’);\n\nconst data = [\n{ year: 34, deaths: 1, event: ‘Stephen’ },\n{ year: 43, deaths: 1, event: ‘James the Greater’ },\n{ year: 54, deaths: 1, event: ‘Philip the Apostle’ },\n{ year: 60, deaths: 1, event: ‘Matthew the Apostle’ },\n{ year: 64, deaths: 100, event: ‘Nero’s Persecution’ },\n{ year: 68, deaths: 1, event: ‘Mark the Apostle’ },\n{ year: 72, deaths: 3, event: ‘Jude, Simon, Thomas (apostles)’ },\n{ year: 81, deaths: 100, event: ‘Domitian’s Persecution’ },\n{ year: 95, deaths: 1, event: ‘John (exile)’ },\n{ year: 107, deaths: 1, event: ‘Ignatius’ },\n{ year: 155, deaths: 1, event: ‘Polycarp’ },\n{ year: 165, deaths: 7, event: ‘Justin Martyr’ },\n{ year: 177, deaths: 48, event: ‘Lyon Persecution’ },\n{ year: 203, deaths: 5, event: ‘Perpetua & Felicity’ },\n{ year: 250, deaths: 100, event: ‘Decius Persecution’ },\n{ year: 258, deaths: 3, event: ‘Sixtus II & Lawrence’ },\n{ year: 303, deaths: 1000, event: ‘Diocletian Persecution’ },\n{ year: 313, deaths: 0, event: ‘Edict of Milan (end)’ },\n{ year: 335, deaths: 100, event: ‘Shapur II’s Persecution’ },\n{ year: 451, deaths: 100, event: ‘Battle of Avarayr (Armenia)’ }\n];\n\nreturn (\n\n\n\n\n\n\n\n\n\n","type":"content","url":"/martyrs-maps","position":1},{"hierarchy":{"lvl1":"Appendix A: Martyrs","lvl2":"Early Church Martyrdoms (1st-5th Centuries)"},"type":"lvl2","url":"/martyrs-maps#early-church-martyrdoms-1st-5th-centuries","position":2},{"hierarchy":{"lvl1":"Appendix A: Martyrs","lvl2":"Early Church Martyrdoms (1st-5th Centuries)"},"content":"\nEstimated number of deaths by year      <div className=\"flex gap-4\">\n        <button\n          onClick={() => setChartType('bar')}\n          className={`px-4 py-2 rounded font-medium transition ${\n            chartType === 'bar'\n              ? 'bg-blue-500 text-white'\n              : 'bg-slate-200 text-slate-800 hover:bg-slate-300'\n          }`}\n        >\n          Bar Chart\n        </button>\n        <button\n          onClick={() => setChartType('line')}\n          className={`px-4 py-2 rounded font-medium transition ${\n            chartType === 'line'\n              ? 'bg-blue-500 text-white'\n              : 'bg-slate-200 text-slate-800 hover:bg-slate-300'\n          }`}\n        >\n          Line Chart\n        </button>\n      </div>\n    </div>\n    \n    <ResponsiveContainer width=\"100%\" height={450}>\n      {chartType === 'bar' ? (\n        <BarChart data={data} margin={{ top: 20, right: 30, left: 0, bottom: 100 }}>\n          <CartesianGrid strokeDasharray=\"3 3\" />\n          <XAxis \n            dataKey=\"year\" \n            angle={-45}\n            textAnchor=\"end\"\n            height={120}\n            label={{ value: 'Year (AD)', position: 'insideBottomRight', offset: -20 }}\n          />\n          <YAxis \n            label={{ value: 'Number of Deaths', angle: -90, position: 'insideLeft' }}\n          />\n          <Tooltip \n            cursor={{ fill: 'rgba(59, 130, 246, 0.1)' }}\n            content={({ active, payload }) => {\n              if (active && payload && payload.length) {\n                return (\n                  <div className=\"bg-white p-3 border border-slate-300 rounded shadow-lg\">\n                    <p className=\"font-semibold text-slate-800\">{payload[0].payload.event}</p>\n                    <p className=\"text-slate-600\">Year: {payload[0].payload.year} AD</p>\n                    <p className=\"text-slate-600\">Deaths: {payload[0].value}</p>\n                  </div>\n                );\n              }\n              return null;\n            }}\n          />\n          <Bar dataKey=\"deaths\" fill=\"#3b82f6\" radius={[8, 8, 0, 0]} />\n        </BarChart>\n      ) : (\n        <LineChart data={data} margin={{ top: 20, right: 30, left: 0, bottom: 100 }}>\n          <CartesianGrid strokeDasharray=\"3 3\" />\n          <XAxis \n            dataKey=\"year\" \n            angle={-45}\n            textAnchor=\"end\"\n            height={120}\n            label={{ value: 'Year (AD)', position: 'insideBottomRight', offset: -20 }}\n          />\n          <YAxis \n            label={{ value: 'Number of Deaths', angle: -90, position: 'insideLeft' }}\n          />\n          <Tooltip \n            cursor={{ stroke: 'rgba(59, 130, 246, 0.5)' }}\n            content={({ active, payload }) => {\n              if (active && payload && payload.length) {\n                return (\n                  <div className=\"bg-white p-3 border border-slate-300 rounded shadow-lg\">\n                    <p className=\"font-semibold text-slate-800\">{payload[0].payload.event}</p>\n                    <p className=\"text-slate-600\">Year: {payload[0].payload.year} AD</p>\n                    <p className=\"text-slate-600\">Deaths: {payload[0].value}</p>\n                  </div>\n                );\n              }\n              return null;\n            }}\n          />\n          <Line \n            type=\"monotone\" \n            dataKey=\"deaths\" \n            stroke=\"#3b82f6\" \n            dot={{ fill: '#3b82f6', r: 4 }}\n            activeDot={{ r: 6 }}\n            strokeWidth={2}\n          />\n        </LineChart>\n      )}\n    </ResponsiveContainer>\n\n    <div className=\"mt-8 p-4 bg-slate-50 rounded-lg border border-slate-200\">\n      <h2 className=\"font-semibold text-slate-800 mb-3\">Key Observations:</h2>\n      <ul className=\"text-sm text-slate-700 space-y-2\">\n        <li>• <strong>Early apostolic period (1st century):</strong> Individual martyrdoms of apostles, sporadic persecution</li>\n        <li>• <strong>Nero's persecution (64-68 AD):</strong> First official Roman persecution, significant increase in deaths</li>\n        <li>• <strong>2nd-3rd centuries:</strong> Intermittent persecutions under various emperors, relatively lower death tolls</li>\n        <li>• <strong>Diocletian's Great Persecution (303-311 AD):</strong> Deadliest period in early church history, thousands of martyrs</li>\n        <li>• <strong>Constantine & after (313+ AD):</strong> Christianity legalized; persecution in Roman Empire ends, but continues in Persian territories</li>\n        <li>• <strong>5th century:</strong> Rare exceptions like Armenia (451 AD), but largely no systemic persecution in formerly pagan lands</li>\n      </ul>\n    </div>\n  </div>\n</div>\n\n);\n}","type":"content","url":"/martyrs-maps#early-church-martyrdoms-1st-5th-centuries","position":3},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs"},"type":"lvl1","url":"/martyrs","position":0},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs"},"content":"It is important to rememeber the main figures of the second-century who were shaping the new church identity in the context of the Roman Empire:\n\nThe Apostolic Fathers\n\nThe Martyrs\n\nThe Apologists\n\nThe Monks\n\nWe have talked about the Apostolic Fathers in the last lecture. Now we will focus on the Martyrs.","type":"content","url":"/martyrs","position":1},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl2":"Who were the Martyrs?"},"type":"lvl2","url":"/martyrs#who-were-the-martyrs","position":2},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl2":"Who were the Martyrs?"},"content":"The term “martyr” comes from the Greek word “μάρτυς” (mártus), which means “witness.” In the context of early Christianity, martyrs were individuals who bore witness to their faith in Jesus Christ, even to the point of death. The early Christian martyrs were often persecuted by the Roman authorities for their refusal to renounce their faith and participate in the state-sanctioned religious practices, which were seen as a threat to the unity and stability of the Roman Empire.\n\nThe stories of the martyrs were highly influential in shaping the identity and theology of the early Christian church. Their courage and steadfastness in the face of persecution served as powerful examples of faith and devotion, inspiring other Christians to remain faithful even in difficult circumstances. The martyrdom of early Christians was often seen as a form of participation in the suffering and death of Christ, and it was believed that those who died for their faith would receive special rewards in the afterlife.","type":"content","url":"/martyrs#who-were-the-martyrs","position":3},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl2":"What was the Gospel for the Martyrs?"},"type":"lvl2","url":"/martyrs#what-was-the-gospel-for-the-martyrs","position":4},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl2":"What was the Gospel for the Martyrs?"},"content":"A great deal of Scriptural texts were used by the early Christians to encourage and strengthen the faith of the martyrs. Some of the key passages that were particularly meaningful to them include:\n\nMark 8:34-35: “Then he called the crowd to him along with his disciples and said: ‘Whoever wants to be my disciple must deny themselves and take up their cross and follow me. For whoever wants to save their life will lose it, but whoever loses their life for me and for the gospel will save it.’”\n\nMatthew 5:10-12: “Blessed are those who are persecuted because of righteousness, for theirs is the kingdom of heaven. Blessed are you when people insult you, persecute you and falsely say all kinds of evil against you because of me. Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets who were before you.”\n\nPhilippians 1:21: “For to me, to live is Christ and to die is gain.”\n\n2 Corinthians 12:10: “That is why, for Christ’s sake, I delight in weaknesses, in insults, in hardships, in persecutions, in difficulties. For when I am weak, then I am strong.”\n\n2 Timothy 4:6-8: “For I am already being poured out like a drink offering, and the time for my departure is near. I have fought the good fight, I have finished the race, I have kept the faith. Now there is in store for me the crown of righteousness, which the Lord, the righteous Judge, will award to me on that day—and not only to me, but also to all who have longed for his appearing.”\n\nRevelation 14:13: “Then I heard a voice from heaven say, ‘Write this: Blessed are the dead who die in the Lord from now on.’ ‘Yes,’ says the Spirit, ‘they will rest from their labor, for their deeds will follow them.’”\n\nRomans 8:35-39: “Who shall separate us from the love of Christ? Shall trouble or hardship or persecution or famine or nakedness or danger or sword? As it is written: ‘For your sake we face death all day long; we are considered as sheep to be slaughtered.’ No, in all these things we are more than conquerors through him who loved us. For I am convinced that neither death nor life, neither angels nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.”\n\nRevelation 2:10: “Do not be afraid of what you are about to suffer. I tell you, the devil will put some of you in prison to test you, and you will suffer persecution for ten days. Be faithful, even to the point of death, and I will give you life as your victor’s crown.”\n\nIt is important to remember that Stephen’s martyrdom and Jesus’ crucifixion set models for the early Christian martyrs. Stephen, as the first Christian martyr, exemplified forgiveness and faithfulness even in the face of death (Acts 7:54-60). Jesus’ own suffering and death on the cross served as the ultimate example of sacrificial love and obedience to God’s will (Philippians 2:5-11). These examples provided a theological framework for understanding martyrdom as a participation in Christ’s own suffering and a witness to the truth of the gospel.\n\nThe martyrs of the early church would see themselves as \n\nParoikoi (resident aliens), a very important concept for the martyrs, as they saw themselves as pilgrims in this world, not fully at home, and looking forward to their true home in heaven.\n\nLater, when Christianity become legal in the Roman Empire, the pilgrim principle will be co-existing with the indigenizing principle, which will create tensions in the church.\n\nThe paradox of the Christian life is a very good place to reflect upon the experience of the martyrs. Christians are called to live in the world but not be of the world (John 17:14-16). They are to be in the world as witnesses to the truth of the gospel, but they are also called to embody an alternative way of life that reflects the values of the kingdom of God.\n\nThe concept of dual citizenship captures this paradox, as Christians are citizens of both the earthly kingdom and the heavenly kingdom. This dual citizenship creates a tension between the demands of the world and the demands of faith, which the martyrs experienced in a profound way.\n\nDiognetus Epistle provides a beautiful description of the Christian identity as resident aliens:\n\n“They live in their respective countries, but only as resident aliens \n\nparoikoi; they participate in all things as citizens, and they endure all things as foreigners [...] They marry like everyone else and have children, but they do not expose them once they are born. They share their meals but not their sexual partners [...] To put the matter simply, what the soul is in the body, this is what Christians are in the world.”\n\nEpistle to Diognetus (2c)\n\nOn Diognetus Epistle\n\n“They love all men, and they are persecuted by all.”","type":"content","url":"/martyrs#what-was-the-gospel-for-the-martyrs","position":5},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl2":"What persecutions did the Martyrs face?"},"type":"lvl2","url":"/martyrs#what-persecutions-did-the-martyrs-face","position":6},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl2":"What persecutions did the Martyrs face?"},"content":"First, it is important to understand that the persecutions faced by the early Christian martyrs were not constant or uniform throughout the Roman Empire. There were periods of relative peace and tolerance, as well as times of intense persecution. The severity and frequency of persecutions varied depending on the local political and social context, as well as the attitudes of individual emperors and governors.","type":"content","url":"/martyrs#what-persecutions-did-the-martyrs-face","position":7},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Jews against Christians","lvl2":"What persecutions did the Martyrs face?"},"type":"lvl3","url":"/martyrs#jews-against-christians","position":8},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Jews against Christians","lvl2":"What persecutions did the Martyrs face?"},"content":"It is notable that the first persecutors of Christians were not the Roman authorities, but rather the Jewish religious leaders. The stoning of Stephen (Acts 7:54-60) and the persecution led by Saul (later Paul) (Acts 8:1-3) are examples of early persecutions initiated by Jewish authorities.\n\nJusto Gonzalez \n\nGonzalez, 2010 explains well that, at first, Jews had some privileges in the Roman Empire to practice their religion freely. As Christianity emerged from Judaism, there was this misunderstanding that Christians were just a sect of Judaism.\n\nHowever, as Christianity began to emerge as a distinct movement from Judaism, tensions arose between the two groups. Christians were often viewed with suspicion and hostility by Jewish authorities, who saw them as a threat to their religious and social order.","type":"content","url":"/martyrs#jews-against-christians","position":9},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Nero against Christians","lvl2":"What persecutions did the Martyrs face?"},"type":"lvl3","url":"/martyrs#nero-against-christians","position":10},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Nero against Christians","lvl2":"What persecutions did the Martyrs face?"},"content":"There was certainly an increase in persecutions during the reign of Emperor Nero (54-68 AD), particularly after the Great Fire of Rome in 64 AD, which Nero blamed on the Christians. This led to widespread persecution and martyrdom of Christians in Rome. \n\nGonzalez, 2010 will again help us understand that Christians were easy targets for Nero, as they were a marginalized and misunderstood group in Roman society. They were often accused of atheism (due to their refusal to worship the Roman gods) and of engaging in secret and subversive activities. This made them vulnerable to persecution, especially during times of crisis or unrest.\n\nOn Nero’s Persecution\n\nInterestingly, there are no records of empire-wide persecutions of Christians until the reign of Emperor Decius (249-251 AD). Decius issued an edict in 250 AD that required all citizens of the empire to perform a sacrifice to the Roman gods and the emperor, which Christians refused to do. This led to a widespread persecution of Christians throughout the empire, with many being arrested, tortured, and executed for their faith.","type":"content","url":"/martyrs#nero-against-christians","position":11},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Domitian against Christians","lvl2":"What persecutions did the Martyrs face?"},"type":"lvl3","url":"/martyrs#domitian-against-christians","position":12},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Domitian against Christians","lvl2":"What persecutions did the Martyrs face?"},"content":"After Nero, Domitian (81-96 AD) also persecuted Christians, particularly in Asia Minor. Little is known about the specifics of Domitian’s persecution, but it is believed that he targeted Christians who refused to participate in the imperial cult and other Roman religious practices. He was considered a tyrant by many, and his reign was marked by political repression and persecution of various groups, including Christians.\n\nOn Domitian’s Persecution\n\nThe book of Revelation is believed to have been written during Domitian’s reign, and it contains references to the persecution of Christians in Asia Minor.\n\nAs it is known, the persecution caused a reverse effect, strengthening the faith of many Christians and leading to the growth of the church. The courage and steadfastness of the martyrs inspired others to remain faithful in the face of persecution, and their witness served as a powerful testimony to the truth of the gospel.\n\nTertullian (c. 155 – c. 240 AD), an early Christian apologist and theologian, wrote extensively about the persecutions faced by Christians in the Roman Empire. In his writings, Tertullian defended the Christian faith against accusations of atheism and immorality, and he also provided a detailed account of the various forms of persecution that Christians endured.\n\nOne of his many quotes on the subject are registered in his work “Apology”:\n\n\"We become more numerous every time we are hewn down by you: the blood of Christians is seed. [...]\n\nIf the River Tiber reaches the walls, if the River Nile does not rise to the fields, if the sky does not move or the earth does, if there is famine, if there is plague, the cry is at once:  ‘The Christians to the lion!’  What, all of them to one lion? \n\nWoodham & others, 1850\"","type":"content","url":"/martyrs#domitian-against-christians","position":13},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Trajan against Christians","lvl2":"What persecutions did the Martyrs face?"},"type":"lvl3","url":"/martyrs#trajan-against-christians","position":14},{"hierarchy":{"lvl1":"Lecture 2.3: Martyrs","lvl3":"Trajan against Christians","lvl2":"What persecutions did the Martyrs face?"},"content":"Emperor Trajan (98-117 AD) is known for his correspondence with Pliny the Younger, the governor of Bithynia-Pontus (in modern-day Turkey), regarding the treatment of Christians in the province. In a letter dated around 112 AD, Pliny sought guidance from Trajan on how to deal with Christians who were being brought before him for trial. Trajan’s response, known as the “Rescript of Trajan,” provided important instructions on the treatment of Christians.\n\nIn his rescript, Trajan advised Pliny not to actively seek out Christians for persecution, but to punish them if they were brought before him and found guilty of being Christians. He instructed Pliny to give Christians the opportunity to renounce their faith and offer sacrifices to the Roman gods, which would demonstrate their loyalty to the empire. If they refused to do so, they were to be punished, but Trajan emphasized that Christians should not be persecuted solely for their religious beliefs.\n\n“Any one who denies being a Christian and actively proves it by adoring our gods must be forgiven on the basis of his repentance, no matter how suspect his past.”\n\n📜 Letter from Pliny to Trajan and Trajan’s Reply\n\nThe source of this text is from \n\nGeorgetown University.\n\nPliny, Letters 10.96-97\n\nPliny to the Emperor Trajan\n\nIt is my practice, my lord, to refer to you all matters concerning which I am in doubt. For who can better give guidance to my hesitation or inform my ignorance? I have never participated in trials of Christians. I therefore do not know what offenses it is the practice to punish or investigate, and to what extent. And I have been not a little hesitant as to whether there should be any distinction on account of age or no difference between the very young and the more mature; whether pardon is to be granted for repentance, or, if a man has once been a Christian, it does him no good to have ceased to be one; whether the name itself, even without offenses, or only the offenses associated with the name are to be punished.\n\nMeanwhile, in the case of those who were denounced to me as Christians, I have observed the following procedure: I interrogated these as to whether they were Christians; those who confessed I interrogated a second and a third time, threatening them with punishment; those who persisted I ordered executed. For I had no doubt that, whatever the nature of their creed, stubbornness and inflexible obstinacy surely deserve to be punished. There were others possessed of the same folly; but because they were Roman citizens, I signed an order for them to be transferred to Rome.\n\nSoon accusations spread, as usually happens, because of the proceedings going on, and several incidents occurred. An anonymous document was published containing the names of many persons. Those who denied that they were or had been Christians, when they invoked the gods in words dictated by me, offered prayer with incense and wine to your image, which I had ordered to be brought for this purpose together with statues of the gods, and moreover cursed Christ--none of which those who are really Christians, it is said, can be forced to do--these I thought should be discharged. Others named by the informer declared that they were Christians, but then denied it, asserting that they had been but had ceased to be, some three years before, others many years, some as much as twenty-five years. They all worshipped your image and the statues of the gods, and cursed Christ.\n\nThey asserted, however, that the sum and substance of their fault or error had been that they were accustomed to meet on a fixed day before dawn and sing responsively a hymn to Christ as to a god, and to bind themselves by oath, not to some crime, but not to commit fraud, theft, or adultery, not falsify their trust, nor to refuse to return a trust when called upon to do so. When this was over, it was their custom to depart and to assemble again to partake of food--but ordinary and innocent food. Even this, they affirmed, they had ceased to do after my edict by which, in accordance with your instructions, I had forbidden political associations. Accordingly, I judged it all the more necessary to find out what the truth was by torturing two female slaves who were called deaconesses. But I discovered nothing else but depraved, excessive superstition.\n\nI therefore postponed the investigation and hastened to consult you. For the matter seemed to me to warrant consulting you, especially because of the number involved. For many persons of every age, every rank, and also of both sexes are and will be endangered. For the contagion of this superstition has spread not only to the cities but also to the villages and farms. But it seems possible to check and cure it. It is certainly quite clear that the temples, which had been almost deserted, have begun to be frequented, that the established religious rites, long neglected, are being resumed, and that from everywhere sacrificial animals are coming, for which until now very few purchasers could be found. Hence it is easy to imagine what a multitude of people can be reformed if an opportunity for repentance is afforded.\n\nTrajan to Pliny\n\nYou observed proper procedure, my dear Pliny, in sifting the cases of those who had been denounced to you as Christians. For it is not possible to lay down any general rule to serve as a kind of fixed standard. They are not to be sought out; if they are denounced and proved guilty, they are to be punished, with this reservation, that whoever denies that he is a Christian and really proves it--that is, by worshiping our gods--even though he was under suspicion in the past, shall obtain pardon through repentance. But anonymously posted accusations ought to have no place in any prosecution. For this is both a dangerous kind of precedent and out of keeping with the spirit of our age.","type":"content","url":"/martyrs#trajan-against-christians","position":15},{"hierarchy":{"lvl1":"Story Of Christianity I"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Story Of Christianity I"},"content":"","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Story Of Christianity I","lvl2":"Introduction"},"type":"lvl2","url":"/#introduction","position":2},{"hierarchy":{"lvl1":"Story Of Christianity I","lvl2":"Introduction"},"content":"This is a journal documenting my journey through the course “Story Of Christianity I” offered by Calvin Seminary. The course explores the history of Christianity from its origins to the medieval period, examining key events, figures, and theological developments.\n\nThis journal will include summaries of lectures, reflections on readings, and personal insights gained throughout the course. It aims to provide a comprehensive overview of the material covered and to deepen my understanding of the Christian faith and its historical context. The main goal is to inform myself and keep track of the knowledge acquired during this educational experience.\n\nDisclaimer\n\nI’ve created the different lecture pages trying to organize them by theme and not necessarily following the order of the lectures. So some of the lecture numbers may not correspond to the actual sequence of the course.\n\nPlease don’t use this journal as a faithful source, as it is primarily for personal use and reflection. While I strive for accuracy in summarizing the course content, it may contain my interpretations and opinions.","type":"content","url":"/#introduction","position":3},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)"},"type":"lvl1","url":"/martyrdoms-jupyter-notebook","position":0},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)"},"content":"This notebook analyzes recorded martyrdoms in the early Christian church across the first five centuries.\n\nimport pandas as pd\nimport plotly.graph_objects as go\nimport plotly.express as px\nfrom plotly.subplots import make_subplots\n\n","type":"content","url":"/martyrdoms-jupyter-notebook","position":1},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Data Collection"},"type":"lvl2","url":"/martyrdoms-jupyter-notebook#data-collection","position":2},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Data Collection"},"content":"Create a comprehensive dataset of recorded martyrdoms from the first 5 centuries of the church.\n\n# Create the martyrdoms dataset\nmartyrdoms_data = {\n    'Year': [34, 43, 54, 60, 64, 68, 72, 81, 95, 107, 155, 165, 177, 203, 250, 258, 303, 313, 335, 451],\n    'Deaths': [1, 1, 1, 1, 100, 1, 3, 100, 1, 1, 1, 7, 48, 5, 100, 3, 1000, 0, 100, 100],\n    'Emperor': ['Tiberius', 'Claudius', 'Nero', 'Nero', 'Nero', 'Nero', 'Vespasian', 'Domitian', 'Domitian', 'Trajan', \n                'Antoninus Pius', 'Marcus Aurelius', 'Marcus Aurelius', 'Septimius Severus', 'Decius', 'Valerian', \n                'Diocletian', 'Constantine', 'Constantine II', 'Theodosius II'],\n    'Event': ['Stephen', 'James the Greater', 'Philip the Apostle', 'Matthew the Apostle', \n              \"Nero's Persecution\", 'Mark the Apostle', 'Jude, Simon, Thomas (apostles)', \n              \"Domitian's Persecution\", 'John (exile)', 'Ignatius of Antioch', 'Polycarp', \n              'Justin Martyr and companions', 'Lyon Persecution', 'Perpetua & Felicity', \n              'Decius Persecution', 'Sixtus II & Lawrence', 'Diocletian Great Persecution', \n              'Edict of Milan (end of persecution)', \"Shapur II's Persecution\", 'Battle of Avarayr (Armenia)'],\n    'Location': ['Jerusalem', 'Jerusalem', 'Hieropolis', 'Ethiopia', 'Rome', 'Alexandria', \n                 'Jerusalem/Edessa/India', 'Roman Empire', 'Patmos/Ephesus', 'Rome', 'Smyrna', \n                 'Rome', 'Lyon (Gaul)', 'Carthage', 'Roman Empire', 'Rome/Carthage', \n                 'Roman Empire', 'Roman Empire', 'Persian Empire', 'Armenia']\n}\n\ndf = pd.DataFrame(martyrdoms_data)\ndf['Period'] = pd.cut(df['Year'], bins=[0, 100, 200, 300, 400, 500], \n                       labels=['1st Century', '2nd Century', '3rd Century', '4th Century', '5th Century'])\n\nprint(df.to_string(index=False))\nprint(f\"\\nTotal estimated martyrs: {df['Deaths'].sum():,}\")\n\n","type":"content","url":"/martyrdoms-jupyter-notebook#data-collection","position":3},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Summary Statistics by Century"},"type":"lvl2","url":"/martyrdoms-jupyter-notebook#summary-statistics-by-century","position":4},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Summary Statistics by Century"},"content":"\n\n# Summary statistics by century\ncentury_summary = df.groupby('Period').agg({\n    'Deaths': ['sum', 'mean', 'count'],\n    'Year': ['min', 'max']\n}).round(2)\n\nprint(\"\\nMartydoms by Century:\")\nprint(century_summary)\n\n","type":"content","url":"/martyrdoms-jupyter-notebook#summary-statistics-by-century","position":5},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Interactive Visualization: Martyrdoms Over Time"},"type":"lvl2","url":"/martyrdoms-jupyter-notebook#interactive-visualization-martyrdoms-over-time","position":6},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Interactive Visualization: Martyrdoms Over Time"},"content":"This interactive chart shows the estimated number of deaths from recorded Christian martyrdoms across five centuries.\n\n# Create interactive Plotly bar chart\nfig = go.Figure()\n\n# Color code by century\ncolors = {\n    '1st Century': '#0ea5e9',\n    '2nd Century': '#06b6d4',\n    '3rd Century': '#f97316',\n    '4th Century': '#ef4444',\n    '5th Century': '#8b5cf6'\n}\n\nfor period in df['Period'].unique():\n    period_data = df[df['Period'] == period]\n    fig.add_trace(go.Bar(\n        x=period_data['Year'],\n        y=period_data['Deaths'],\n        name=period,\n        marker_color=colors[period],\n        hovertemplate='<b>%{customdata[0]}</b><br>' +\n                      'Year: %{x} AD<br>' +\n                      'Deaths: %{y}<br>' +\n                      'Emperor: %{customdata[1]}<br>' +\n                      'Location: %{customdata[2]}<extra></extra>',\n        customdata=period_data[['Event', 'Emperor', 'Location']].values\n    ))\n\nfig.update_layout(\n    title={\n        'text': 'Early Church Martyrdoms (1st-5th Centuries)',\n        'x': 0.5,\n        'xanchor': 'center',\n        'font': {'size': 24, 'color': '#1e293b'}\n    },\n    xaxis_title='Year (AD)',\n    yaxis_title='Estimated Number of Deaths',\n    hovermode='x unified',\n    template='plotly_white',\n    height=600,\n    font=dict(size=12),\n    xaxis=dict(\n        showgrid=True,\n        gridwidth=1,\n        gridcolor='#e2e8f0'\n    ),\n    yaxis=dict(\n        showgrid=True,\n        gridwidth=1,\n        gridcolor='#e2e8f0'\n    ),\n    legend=dict(\n        orientation='h',\n        yanchor='bottom',\n        y=1.02,\n        xanchor='right',\n        x=1\n    )\n)\n\nfig.show()\n\n# Save for Myst integration\nfig.write_html('martyrdoms_chart.html')\nprint(\"Chart saved as 'martyrdoms_chart.html'\")\n\n","type":"content","url":"/martyrdoms-jupyter-notebook#interactive-visualization-martyrdoms-over-time","position":7},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Cumulative Martyrdoms Over Time"},"type":"lvl2","url":"/martyrdoms-jupyter-notebook#cumulative-martyrdoms-over-time","position":8},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Cumulative Martyrdoms Over Time"},"content":"\n\n# Create cumulative deaths visualization\ndf_sorted = df.sort_values('Year')\ndf_sorted['Cumulative_Deaths'] = df_sorted['Deaths'].cumsum()\n\nfig_cumulative = go.Figure()\n\nfig_cumulative.add_trace(go.Scatter(\n    x=df_sorted['Year'],\n    y=df_sorted['Cumulative_Deaths'],\n    mode='lines+markers',\n    name='Cumulative Deaths',\n    line=dict(color='#ef4444', width=3),\n    marker=dict(size=8),\n    hovertemplate='<b>Year %{x} AD</b><br>' +\n                  'Cumulative Deaths: %{y}<extra></extra>'\n))\n\nfig_cumulative.update_layout(\n    title={\n        'text': 'Cumulative Christian Martyrdoms (1st-5th Centuries)',\n        'x': 0.5,\n        'xanchor': 'center',\n        'font': {'size': 24, 'color': '#1e293b'}\n    },\n    xaxis_title='Year (AD)',\n    yaxis_title='Total Estimated Deaths',\n    template='plotly_white',\n    height=500,\n    hovermode='x',\n    font=dict(size=12),\n    xaxis=dict(showgrid=True, gridcolor='#e2e8f0'),\n    yaxis=dict(showgrid=True, gridcolor='#e2e8f0')\n)\n\nfig_cumulative.show()\nfig_cumulative.write_html('martyrdoms_cumulative.html')\nprint(\"Chart saved as 'martyrdoms_cumulative.html'\")\n\n","type":"content","url":"/martyrdoms-jupyter-notebook#cumulative-martyrdoms-over-time","position":9},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Analysis by Emperor"},"type":"lvl2","url":"/martyrdoms-jupyter-notebook#analysis-by-emperor","position":10},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Analysis by Emperor"},"content":"\n\n# Group by emperor\nemperor_summary = df.groupby('Emperor').agg({\n    'Deaths': 'sum',\n    'Event': 'count'\n}).rename(columns={'Event': 'Number of Events'}).sort_values('Deaths', ascending=False)\n\nprint(\"\\nMartydoms by Emperor:\")\nprint(emperor_summary)\n\n# Visualization\nfig_emperor = px.bar(\n    emperor_summary.reset_index(),\n    x='Emperor',\n    y='Deaths',\n    title='Total Recorded Martyrdoms by Emperor',\n    labels={'Deaths': 'Estimated Number of Deaths', 'Emperor': 'Roman Emperor'},\n    color='Deaths',\n    color_continuous_scale='Reds',\n    height=500\n)\n\nfig_emperor.update_layout(\n    template='plotly_white',\n    hovermode='x unified',\n    xaxis_tickangle=-45\n)\n\nfig_emperor.show()\nfig_emperor.write_html('martyrdoms_by_emperor.html')\nprint(\"Chart saved as 'martyrdoms_by_emperor.html'\")\n\n","type":"content","url":"/martyrdoms-jupyter-notebook#analysis-by-emperor","position":11},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Key Findings"},"type":"lvl2","url":"/martyrdoms-jupyter-notebook#key-findings","position":12},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl2":"Key Findings"},"content":"","type":"content","url":"/martyrdoms-jupyter-notebook#key-findings","position":13},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl3":"Notable Observations:","lvl2":"Key Findings"},"type":"lvl3","url":"/martyrdoms-jupyter-notebook#notable-observations","position":14},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl3":"Notable Observations:","lvl2":"Key Findings"},"content":"Diocletian’s Great Persecution (303 AD) accounts for ~45% of all recorded early church martyrdoms\n\nNero’s Persecution (64-68 AD) was the first major official persecution\n\n2nd-3rd Centuries: Sporadic persecutions with relatively lower death tolls\n\nConstantine’s Legalization (313 AD) marked the end of systematic Roman persecution\n\n5th Century: Persecution largely ceased in the Roman Empire but continued in some regions (e.g., Armenia)","type":"content","url":"/martyrdoms-jupyter-notebook#notable-observations","position":15},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl3":"Data Limitations:","lvl2":"Key Findings"},"type":"lvl3","url":"/martyrdoms-jupyter-notebook#data-limitations","position":16},{"hierarchy":{"lvl1":"Early Church Martyrdoms (1st-5th Centuries)","lvl3":"Data Limitations:","lvl2":"Key Findings"},"content":"Many estimates are based on historical records and church tradition\n\nExact dates and death tolls for large persecutions are often uncertain\n\nSome figures (George, Catherine, Sebastian) have legendary elements mixed with historical accounts\n\nThis represents only documented/recorded martyrdoms, likely undercounting actual totals\n\n# Export data to CSV for reference\ndf.to_csv('early_church_martyrdoms.csv', index=False)\nprint(\"Data exported to 'early_church_martyrdoms.csv'\")","type":"content","url":"/martyrdoms-jupyter-notebook#data-limitations","position":17}]}